Tekla.Structures.Drawing.AttributesBase
The AttributesBase class is the class that all the main attributes that can load attribute files inherit from.

Tekla.Structures.Drawing.AttributesBase.#ctor
A constructor for creating new Attributes using the "standard" attribute file.

Tekla.Structures.Drawing.AttributesBase.#ctor(System.Boolean)
A constructor for creating new Attributes using the "standard" attribute file.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.AttributesBase.#ctor(System.String)
Constructor to create new Attributes using specified attributes file.
AttributeFile: Please enter only the filename not the extension

Tekla.Structures.Drawing.AttributesBase.#ctor(System.String,System.Boolean)
Constructor to create new Attributes using specified attributes file.
AttributeFile: Please enter only the filename not the extension
DoNotLoadAttributes: Instructs constructor to not automatically load the attributes, this is a special case and LoadAttributes HAS TO BE CALLED shortly after.

Tekla.Structures.Drawing.AttributesBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.AttributesBase.LoadAttributes(System.String)
Loads the attributes from the specified file.
AttributeFile: The filename of the attribute file. Use only the filename, not the extension.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.